AUTO_config_TK_pesok/src/Catalogs/Карточки/Карточки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Карточки</name>
  <comment>Дисконтные, пользовательские, командные карты</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПредставлениеКарты</name>
    <comment>Печатное наименование карточки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <comment>(АСУ by 4ok)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий по карточке</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата создания карточки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <comment>Дата окончания действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДисконтнойКарты</name>
    <comment>Тип дисконтной карты</comment>
    <type>
      <types>CatalogRef.ТипыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>Заблокирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Платежная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗаполнения</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>190</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>190</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/Карточки/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура Назад(Команда)
	Элементы.Загрузка.Видимость = Ложь;
	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.Основная;
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыНаСервере(ШтрихКод)
	Карточка = Справочники.Карточки.СоздатьЭлемент();
	Карточка.ДатаСоздания = ?(ЗначениеЗаполнено(НачалоПериода),НачалоПериода,ТекущаяДата());
	Карточка.ОкончаниеДействия = КонецПериода;
	Карточка.ТипДисконтнойКарты = ТипКарты;
	Карточка.ШтрихКод = ШтрихКод;
	Карточка.Наименование = ШтрихКод;
	Карточка.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакет()
	ТабличныйДокумент = Справочники.Карточки.ПолучитьМакет("Макет");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлементы(Команда)
	Если ТабличныйДокумент.ВысотаТаблицы = 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных для загрузки!");
	КонецЕсли;
	
	ИтогСоздано = 0;
	
	Для Стр = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл 
		
		тШтрихКод = СокрЛП(ТабличныйДокумент.Область(Стр, 1).Текст);
		Если СтрДлина(тШтрихКод) < 13 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("В строке "+стр+" некорректно указан штрихкод карточки "+тШтрихКод +", проверьте правильность заполнения!");
			Продолжить;
		КонецЕсли;
		
		СоздатьЭлементыНаСервере(тШтрихКод);
		
		ИтогСоздано = ИтогСоздано+1;
		
	КонецЦикла;
	ОбщегоНазначенияКлиент.СообщитьПользователю("Создано "+ИтогСоздано+" записей!");
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Элементы.Загрузка.Видимость = Истина;
	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.Загрузка;
	
	ЗаполнитьМакет();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьМакет();
КонецПроцедуры
